app/controllers/application_controller.rb

  def current_user
    @user ||= User.find_by(user_id: session[:user_id])
---
SELECT "users".* FROM "users" WHERE "users"."user_id" = ? LIMIT ?  [["user_id", "113264017408530903896"], ["LIMIT", 1]]