app/controllers/session_controller.rb

  def create
    if id_token = flash[:google_sign_in]['id_token']
      user_params = GoogleSignIn::Identity.new(id_token)
      if (!User.exists?(user_id: user_params.user_id))
        new_user = User.new
        new_user.user_id = user_params.user_id
        new_user.name = user_params.name
        new_user.email = user_params.email_address
        new_user.profile_img = user_params.avatar_url
        new_user.save!
---
SELECT 1 AS one FROM "users" WHERE "users"."user_id" = ? LIMIT ?  [["user_id", "113264017408530903896"], ["LIMIT", 1]]
INSERT INTO "users" ("name", "email", "profile_img", "user_id") VALUES (?, ?, ?, ?)