app/controllers/tasks_controller.rb

SELECT "tasks".* FROM "tasks" WHERE "tasks"."completion_date" IS NULL AND "tasks"."user_id" = ?  [["user_id", "113264017408530903896"]]
---
  def index
    @show_completed = params[:show_completed] == 'true'
    @tasks = @show_completed ? Task.where(user_id: session[:user_id]) : Task.where(completion_date: nil, user_id: session[:user_id])